import React from 'react'
import Image from "next/image";
import ImageScroller from "@/components/ImageScroller";
import {Button} from "@/components/ui/button";
import Link from "next/link";
import { images_section_three} from "@/data/images";
import {auth} from "@/auth";


const  Page = async () => {
    const session=await auth();
    if(!session) return <div>NOt authenticated 404 your brain</div>
    return (
        <><div className="flex flex-col justify-center items-center">
            <h1 className="heading">Καλλιμάρμαρο - Παναθηναϊκό Στάδιο</h1>
            <br/><br/>
            <p className="plain-text mx-10">
                Το Παναθηναϊκό Στάδιο, γνωστό και ως Καλλιμάρμαρο, είναι αρχαίο ελληνικό στάδιο στην Αθήνα, το οποίο βρίσκεται στην
                περιοχή του Παγκρατίου ανατολικά του Ζαππείου και βόρεια του λόφου του Αρδηττού, δια των οποίων διέρχεται ο Ιλισός ποταμός.
                Στο Παναθηναϊκό Στάδιο, έγιναν αγωνίσματα των Α΄ σύγχρονων Ολυμπιακών Αγώνων, το 1896. Με την ανακατασκευή του
                Σταδίου για τη διεξαγωγή των πρώτων Σύγχρονων Ολυμπιακών Αγώνων ξεκίνησε και η ανάπτυξη της ευρύτερης συνοικίας
                του Παγκρατίου.</p>

            <br/><br/>

                <p className={"flex flex-col plain-text mx-10"}>
                    <span className=" flex items-center justify-center">
                    <Image src="/kallimarmaro.jpg" alt="hi" width={200} height={20} className="w-2/4 mb-6" /></span>
                    Στην αρχαιότητα χρησιμοποιούνταν για την τέλεση μέρους των Παναθηναίων

                    προς τιμήν της θεάς Αθηνάς. Κτισμένο ανάμεσα στους λόφους του Άγρα και Αρδηττού, το 329 π.Χ., επί Λυκούργου, το
                    στάδιο ορθομαρμαρώθηκε, καθώς μέχρι τότε τα καθίσματα ήταν ξύλινα. Το 140 μ.Χ. επί Ηρώδη του Αττικού έγινε μια
                    μεγάλης κλίμακας ανακαίνιση, καθώς και αύξηση της χωρητικότητάς του στις 50.000 θέσεις. Σε άγνωστους χρόνους του
                    Μεσαίωνα είχε απογυμνωθεί τελείως από τα μάρμαρά του, όπως και τα πλείστα αρχαία κτήρια της Αθήνας. Όταν ο Βασιλιάς
                    Όθων κήρυξε την Αθήνα πρωτεύουσα του Ελληνικού Βασιλείου στο «Καλλιμάρμαρο», μόνο οι δύο κρηπιδότοιχοι των μετώπων
                    δεξιά και αριστερά της εισόδου απέμεναν ως εμφανή ερείπια του άλλοτε σταδίου.

                    Περί το 1856 ο Ευάγγελος Ζάππας προσφέρθηκε να διαθέσει τις δαπάνες για την αναμαρμάρωση του σταδίου αυτού σε
                    συνδυασμό με την άνωθεν της σφενδόνης του σταδίου προβλεπόμενο χώρο κτηρίου για εκθέσεις. Έτσι η εκπόνηση των
                    σχεδίων ανατέθηκε στον Φρανσουά Μπουλανζέ, πλην όμως η πραγματοποίηση του έργου υπό αυτή τη μορφή ματαιώθηκε.
                    Το 1874 και προκειμένου να γίνουν το επόμενο έτος οι καθιερωθέντες από τον Ζάππα Ολυμπιακοί Αγώνες, κτίσθηκε
                    εκ του κληροδοτήματός του η προ του Σταδίου γέφυρα του Ιλισού. Τότε και ισοπεδώθηκε πρόχειρα ο στίβος και στήθηκαν
                    στο βάθος της σφενδόνης ξύλινες βαθμίδες για τους επισήμους. Το 1895 και προκειμένου το επόμενο έτος να γίνουν
                    οι προβλεπόμενοι Ολυμπιακοί αγώνες αποφασίσθηκε η μερική αναμαρμάρωση του Σταδίου επί σχεδίων που είχαν εκπονήσει
                    οι Αναστάσιος Μεταξάς και Ερνέστος Τσίλλερ. Τότε ζητήθηκε από τον Διάδοχο Κωνσταντίνο η οικονομική βοήθεια του
                    Γεωργίου Αβέρωφ. Πράγματι ανταποκρινόμενος περισσότερο του προβλεπόμενου, ο εθνικός αυτός ευεργέτης ανέλαβε να
                    προσφέρει οικονομικά όλη την δαπάνη για την ολοκλήρωση του έργου. Όμως επειδή ο χρόνος δεν επαρκούσε μέχρι το
                    1896, ολοκληρώθηκε η περί τη σφενδόνη μαρμάρωση των κερκίδων, καθώς και όλων των πρώτων τουλάχιστον σειρών από
                    του στίβου. Τότε και ανεγέρθηκε ο ανδριάντας του Γεωργίου Αβέρωφ προ του σταδίου (που σήμερα φέρεται δεξιά
                    της εισόδου), έργο του γλύπτη Γεώργιου Βρούτου, ενώ το ίδιο το οικοδόμημα λάμβανε την προσωνυμία «Καλλιμάρμαρο».
                    Στα επόμενα έτη συνεχίσθηκαν οι εργασίες της μαρμάρωσης όλου του Σταδίου οι οποίες και ολοκληρώθηκαν το 1900.

                    Το 1906, στο στάδιο έλαβαν χώρα οι Θερινοί Ολυμπιακοί Αγώνες 1906 (ή Μεσοολυμπιακοί Αγώνες 1906). Στις 4
                    Απριλίου 1968, έλαβε χώρα ο τελικός του Ευρωπαϊκού Κυπέλλου Κυπελλούχων 1967-68 στην καλαθοσφαίριση, όπου
                    η ΑΕΚ επικράτησε της Σλάβια Πράγας μπροστά σε περίπου 80.000 καθήμενους θεατές εντός του σταδίου και άλλους 40.000
                    όρθιους. Πιστεύεται, πως από τότε το Παναθηναϊκό Στάδιο διατηρεί το παγκόσμιο ρεκόρ προσέλευσης για οποιονδήποτε
                    αγώνα καλαθοσφαίρισης σε εξωτερικό χώρο.

                    Το Παναθηναϊκό Στάδιο της Αθήνας γνώρισε μεγάλες δόξες, εθνικές, πολιτικές αλλά και καλλιτεχνικές όπως το
                    ανέβασμα της όπερας Αΐντα. Στο στάδιο επίσης αυτό διοργανώθηκε για κάποια χρόνια και η Ολυμπιάδα τραγουδιού, η οποία διακόπηκε. Το 1996 στο Στάδιο έγινε η υποδοχή των Ολυμπιονικών της Ατλάντα και το 1997 φιλοξένησε τη τελετή έναρξης του 6ου Παγκοσμίου Πρωταθλήματος Στίβου, που παρουσιάστηκε από το συνθέτη διεθνούς φήμης Βαγγέλη Παπαθανασίου. Στους πρόσφατους όμως Ολυμπιακούς Αγώνες το Καλλιμάρμαρο υποδέχθηκε τους μαραθωνοδρόμους και τοξοβόλους ενώ σε αυτό αποθεώθηκε η Εθνική Ομάδα της Ελλάδος που κατέκτησε το Πανευρωπαϊκό Πρωτάθλημα το 2004.

                    Στις 17 Μαΐου 2012 η Ολυμπιακή φλόγα παραδόθηκε στην πριγκίπισσα Άννα, για να μεταφερθεί στην Μεγάλη
                    Βρετανία αεροπορικώς στις 27 Ιουλίου 2012.


                    Το Παναθηναϊκό Στάδιο είναι ιδιοκτησία της Ελληνικής Ολυμπιακής Επιτροπής.
                </p>
        </div>
            <span className="mb-5 items-center"><ImageScroller images={images_section_three}/></span>
        <div className="flex flex-col justify-center items-center">
            <Button className="button-style mb-20"> <Link href="/quiz/section-3/quiz">ΞΕΚΙΝΑ ΤΟ QUIZ </Link></Button>
        </div>
        </>

    )
}
export default Page
