import React from 'react'
import Image from "next/image";
import ImageScroller from "@/components/ImageScroller";
import {Button} from "@/components/ui/button";
import Link from "next/link";
import {images_section_one} from "@/data/images";
import {auth} from "@/auth";
import QuizCheck from "@/components/QuizCheck";


const  Page = async () => {
    const session=await auth();
    if(!session) return <div>NOt authenticated 404 your brain</div>
    return (
        <>
            <QuizCheck unit={"unit1"}/>
            <div className="flex flex-col justify-center items-center">
            <h1 className="heading">Ζάππειον Μέγαρο</h1>
            <br/><br/>
            <p className="plain-text mx-10">
                Το Ζάππειον Μέγαρο, ή απλά Ζάππειο, είναι ένα από τα σημαντικότερα κτήρια της Αθήνας.
                Βρίσκεται νότια του Εθνικού Κήπου και των παλαιών Ανακτόρων και δυτικά του Παναθηναϊκού
                Σταδίου. Η ανέγερσή του χρηματοδοτήθηκε από τον εθνικό ευεργέτη Ευάγγελο Ζάππα και
                ολοκληρώθηκε το 1888. Το νεοκλασικό μέγαρο είναι συνυφασμένο με την ιστορία της νεότερης
                Ελλάδας. Σήμερα λειτουργεί ως συνεδριακό και εκθεσιακό κέντρο.</p>

            <br/><br/>

                <p className={"flex flex-col-2 plain-text mx-10"}>Το Ζάππειο έχει περίπου 25 δωμάτια (97 μ² με 984 μ²). Η αρχική χρήση του κτηρίου και του προαύλιου χώρου ήταν για τα «Νέα Ολύμπια», μια γεωργική,
                τεχνική και βιομηχανική έκθεση που ορίστηκε να πραγματοποιείται κάθε τετραετία στο Ζάππειο.
                Χρησιμοποιήθηκε επίσης από το Εθνικό Ίδρυμα Ραδιοφωνίας και από τις εγκαταστάσεις του εξέπεμπε
                από το 1938 ο κρατικός ραδιοσταθμός Αθηνών. Οι εκπομπές παράγονταν στους ραδιοθαλάμους του Ζαππείου,
                ενώ χρησιμοποιήθηκε η κεραία μεσαίων κυμάτων των Λιοσίων. Χρησιμοποιήθηκε στους Ολυμπιακούς Αγώνες
                του 1896 για τους αγώνες ξιφασκίας. Στη Μεσολυμπιάδα του 1906 χρησιμοποιήθηκε σαν Ολυμπιακό χωριό
                ενώ στους Ολυμπιακούς του 2004 αποτέλεσε κέντρο τύπου και εκδηλώσεων. Πολλά ιστορικά γεγονότα
                πραγματοποιήθηκαν στο Ζάππειο με αποκορύφωμα την ιστορική υπογραφή της συνθήκης προσχώρησης της
                Ελλάδας στην Ευρωπαϊκή Ένωση (τότε Ε.Ο.Κ.) τη 1η Ιανουαρίου του 1981 από τον Κωνσταντίνο Καραμανλή.
                Επίσης, μετά από τη μεταπολίτευση, το Ζάππειο αποτέλεσε το κέντρο τύπου σε όλες τις Γενικές Εκλογές της
                χώρας, όπου οι νικητές και οι ηττημένοι των εκλογών δίνουν την καθιερωμένη συνέντευξη μετά το τέλος
                των εκλογών. Ο χώρος του Ζαππείου χρησιμοποιήθηκε και χρησιμοποιείται για διάφορες εκθέσεις και τελετές.
                Ιδιαίτερα γνωστό και αγαπητό στους Αθηναίους όλων των γενεών είναι το αναψυκτήριο "Αίγλη του Ζαππείου",
                που έχει ιστορία πολλών δεκαετιών.<Image src="/background.png" alt="hi" width={500} height={300} />
                </p>
        </div>
            <span className="mb-5 items-center"><ImageScroller images={images_section_one}/></span>
        <div className="flex flex-col justify-center items-center">
            <Button className="button-style mb-20"> <Link href="/quiz/section-1/quiz">ΞΕΚΙΝΑ ΤΟ QUIZ </Link></Button>
        </div>
        </>

    )
}
export default Page
